# DimensionWithCommonLengthUnit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..DimensionWithCommonLengthUnit Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
A shape dimension is labelled with a parameter that uses the Common Length unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionWithCommonLengthUnit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionWithCommonLengthUnit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionWithCommonLengthUnit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace